## PANDAS DOCUMENTATION

In [20]:
li=[1,2,3,4,5]

In [21]:
dic={'name':['siri','chandana','reddy'],'age':[23,22,21],'initial':['tamlamp','gii','hveu']}

In [22]:
dic1={'name':['siri','rash','srav'],'initial':['tamalamp','ee','ef'],'location':['rjy','bangalore','hyderabad']}

In [23]:
import pandas as pd
import numpy as np

In [24]:
df=pd.Series(li,index=[2,3,4,5,6])
df

2    1
3    2
4    3
5    4
6    5
dtype: int64

In [25]:
df=pd.Series(dic1)

In [26]:
df

name                 [siri, rash, srav]
initial              [tamalamp, ee, ef]
location    [rjy, bangalore, hyderabad]
dtype: object

In [27]:
df=pd.DataFrame(li)

In [28]:
df

   0
0  1
1  2
2  3
3  4
4  5

In [35]:
df1=pd.DataFrame(dic1)

In [38]:
df1

   name   initial   location
0  siri  tamalamp        rjy
1  rash        ee  bangalore
2  srav        ef  hyderabad

## Reading info from table

In [39]:
df.initial

0    tamalamp
1          ee
2          ef
Name: initial, dtype: object

In [40]:
df=pd.DataFrame(dic)

In [41]:
df1=pd.DataFrame(dic1)

In [42]:
df.shape

(3, 3)

In [43]:
df.columns

Index(['name', 'age', 'initial'], dtype='object')

In [44]:
df.age>20

0    True
1    True
2    True
Name: age, dtype: bool

In [46]:
df.age>21

0     True
1     True
2    False
Name: age, dtype: bool

In [47]:
df[df.age>21]

       name  age  initial
0      siri   23  tamlamp
1  chandana   22      gii

In [48]:
df.age.describe()

count     3.0
mean     22.0
std       1.0
min      21.0
25%      21.5
50%      22.0
75%      22.5
max      23.0
Name: age, dtype: float64

In [50]:
df.age.max()

23

In [51]:
df.age.min()

21

In [52]:
df.age.sum()

66

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     3 non-null      object
 1   age      3 non-null      int64
 2   initial  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [54]:
df.loc[0:1,['name','age']]

       name  age
0      siri   23
1  chandana   22

In [56]:
df.iloc[0:2,0:2]

       name  age
0      siri   23
1  chandana   22

## UPdating the info in table using pandas

In [57]:

df1.columns

Index(['name', 'initial', 'location'], dtype='object')

In [59]:
df1['jobrole']=['developer','tester','analyst']    #to add new colummn

In [60]:
df1

   name   initial   location    jobrole
0  siri  tamalamp        rjy  developer
1  rash        ee  bangalore     tester
2  srav        ef  hyderabad    analyst

In [63]:
df.pop('jobrole')

0    developer
1       tester
2      analyst
Name: jobrole, dtype: object

In [64]:
df

       name  age  initial
0      siri   23  tamlamp
1  chandana   22      gii
2     reddy   21     hveu

In [65]:
df1

   name   initial   location    jobrole
0  siri  tamalamp        rjy  developer
1  rash        ee  bangalore     tester
2  srav        ef  hyderabad    analyst

In [66]:
#to insert column in middle 

df1.insert(1,'gender',['female','female','male'])

In [67]:
df1

   name  gender   initial   location    jobrole
0  siri  female  tamalamp        rjy  developer
1  rash  female        ee  bangalore     tester
2  srav    male        ef  hyderabad    analyst

In [70]:
#to add row 

new_r={'name':'priya','gender':'female','initial':'medapai','location':'USA','jobrole':'Scientist'}

df1.append([new_r])

    name  gender   initial   location    jobrole
0   siri  female  tamalamp        rjy  developer
1   rash  female        ee  bangalore     tester
2   srav    male        ef  hyderabad    analyst
0  priya  female   medapai        USA  Scientist

##  DEleting the info in table using pandas

In [71]:
df1.pop('jobrole')

0    developer
1       tester
2      analyst
Name: jobrole, dtype: object

In [72]:
df1

   name  gender   initial   location
0  siri  female  tamalamp        rjy
1  rash  female        ee  bangalore
2  srav    male        ef  hyderabad

## DEleting null values in table while cleaning the data

In [73]:
df1.isnull()

    name  gender  initial  location
0  False   False    False     False
1  False   False    False     False
2  False   False    False     False

In [74]:
df1.isnull().sum()

name        0
gender      0
initial     0
location    0
dtype: int64

In [75]:
df.dropna()  #deleting null values rows if there is any

       name  age  initial
0      siri   23  tamlamp
1  chandana   22      gii
2     reddy   21     hveu

## Groupby - (SPLIT,APPLY AND COMBINE)

In [81]:
g=df.groupby(['name'])       #will split the values based on name

In [82]:
 g.get_group('siri')       #will get the group containing name 'siri'

   name  age  initial
0  siri   23  tamlamp

In [83]:
g.mean()

           age
name
chandana  22.0
reddy     21.0
siri      23.0

In [86]:
df.append([{'name':'siri','age':23,'intial':'bfir'}])

       name  age  initial intial
0      siri   23  tamlamp    NaN
1  chandana   22      gii    NaN
2     reddy   21     hveu    NaN
0      siri   23      NaN   bfir

In [87]:
g=df.groupby(['name']).mean()

In [88]:
g

           age
name
chandana  22.0
reddy     21.0
siri      23.0

## Getting Dummies

In [90]:
df=df.append([{'name':'siri','age':23,'intial':'bfir'}])

In [91]:
df1

   name  gender   initial   location
0  siri  female  tamalamp        rjy
1  rash  female        ee  bangalore
2  srav    male        ef  hyderabad

In [92]:
df1_dummy=pd.get_dummies(df1['gender'])

In [93]:
df1_dummy

   female  male
0       1     0
1       1     0
2       0     1

## Concatening

In [118]:
pd.concat([df1,df],join='inner')

       name   initial
0      siri  tamalamp
1      rash        ee
2      srav        ef
0      siri   tamlamp
1  chandana       gii
2     reddy      hveu
0      siri       NaN

## Merging

In [96]:
df1

   name  gender   initial   location
0  siri  female  tamalamp        rjy
1  rash  female        ee  bangalore
2  srav    male        ef  hyderabad

In [102]:
df

       name  age  initial intial
0      siri   23  tamlamp    NaN
1  chandana   22      gii    NaN
2     reddy   21     hveu    NaN
0      siri   23      NaN   bfir

In [103]:
df.pop('intial')

0     NaN
1     NaN
2     NaN
0    bfir
Name: intial, dtype: object

In [104]:
df

       name  age  initial
0      siri   23  tamlamp
1  chandana   22      gii
2     reddy   21     hveu
0      siri   23      NaN

In [106]:
pd.merge(df,df1,on=['name'],how='outer')

       name   age initial_x  gender initial_y   location
0      siri  23.0   tamlamp  female  tamalamp        rjy
1      siri  23.0       NaN  female  tamalamp        rjy
2  chandana  22.0       gii     NaN       NaN        NaN
3     reddy  21.0      hveu     NaN       NaN        NaN
4      rash   NaN       NaN  female        ee  bangalore
5      srav   NaN       NaN    male        ef  hyderabad

In [112]:
pd.merge(df,df1,on=['name'],how='inner')

   name  age initial_x  gender initial_y location
0  siri   23   tamlamp  female  tamalamp      rjy
1  siri   23       NaN  female  tamalamp      rjy

In [113]:
pd.merge(df,df1,on=['name'],how='left')

       name  age initial_x  gender initial_y location
0      siri   23   tamlamp  female  tamalamp      rjy
1  chandana   22       gii     NaN       NaN      NaN
2     reddy   21      hveu     NaN       NaN      NaN
3      siri   23       NaN  female  tamalamp      rjy

In [110]:
pd.merge(df,df1,on=['name'],how='right')

   name   age initial_x  gender initial_y   location
0  siri  23.0   tamlamp  female  tamalamp        rjy
1  siri  23.0       NaN  female  tamalamp        rjy
2  rash   NaN       NaN  female        ee  bangalore
3  srav   NaN       NaN    male        ef  hyderabad

In [119]:
df.corr() #correlation

     age
age  1.0